#1. Να τυπώσετε το πλαίσιο δεδομένων iris.

#2. Να προβάλετε τη δομή και τις συνοπτικές πληροφορίες.

#3. Να προβάλετε τον τύπο για κάθε μεταβλητή του πλαισίου δεδομένων iris.

#4. Να επιλέξετε την 3η γραμμή του πλαισίου δεδομένων iris.

#5. Να επιλέξετε το στοιχείο της 2ης γραμμής και 2ης στήλης του πλαισίου δεδομένων iris.

#6. Να επιλέξετε την στήλη με τη μεταβλητή Sepal.Length.

#7. Να επιλέξετε την στήλη με τη μεταβλητή Sepal.Width.

#8. Να αφαιρέσετε τη μεταβλητή Sepal.Width από την Sepal.Length.

#9. Να προσθέσετε το αποτέλεσμα ως νέα στήλη με όνομα Sepal.Diff στο πλαίσιο δεδομένων iris.

#10. Να αφαιρέσετε τις τέσσερις πρώτες γραμμές.

#11. Να επιλέξετε το υποσύνολο του iris, με το είδος versicolor.

#12. Να επιλέξετε το υποσύνολο του iris, με όσες τιμές της μεταβλητής Sepal.Width είναι μεγαλύτερες του 3.5.

#13. Να ταξινομήσετε το πλαίσιο δεδομένων iris ως προς τη μεταβλητή Sepal.Diff.
